# LActLayer

## Description
Function LActLayer returns a handle to the last object in the active layer.

```pascal
FUNCTION LActLayer : HANDLE;
```

```python
def vs.LActLayer():
    return HANDLE
```

## Remarks
Returns a handle to the last object in the active layer.

[sd 8/14/98]

## Examples
```pascal
resultH := LActLayer;
```
```python
import vs

# Function LActLayer returns a handle to the last object in the active layer.
objHandle = vs.LActLayer()
if objHandle is not None:
    vs.Message('Created object handle: ' + str(objHandle))
```

## See Also
Relative calls:
* NextObj | PrevObj
* FObject | LObject
* FSActLayer | LSActLayer
* FSObject  | LActLayer
* NextDObj | PrevDObj
* NextSObj | PrevSObj

## Version
Availability: from All Versions

## Category
* Document List Handling